# Определение компилятора
CXX=g++

# Определение флагов компиляции
CXXFLAGS=-Wall -Wextra -std=c++11

# Название цели (исполняемый файл)
TARGET=main

# Список исходных файлов
SOURCES=main.cpp

# Список объектных файлов
OBJECTS=$(SOURCES:.cpp=.o)

# Правило для сборки всего проекта
all: $(TARGET)

# Правило для создания исполняемого файла
$(TARGET): $(OBJECTS)
	$(CXX) $(CXXFLAGS) -o $@ $^

# Правило для создания объектных файлов
%.o: %.cpp
	$(CXX) $(CXXFLAGS) -c $<

# Правило для очистки проекта (удаление объектных файлов и исполняемого файла)
clean:
	rm -f $(OBJECTS) $(TARGET)

# Помечаем 'clean' как фиктивную цель
.PHONY: all clean
